# GridBankRowNum Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridBankRowNum Property
ParameterTypeId Class See Also
---
"Row"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridBankRowNum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridBankRowNum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridBankRowNum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace